In [5]:
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [3]:
temp_db = create_engine('sqlite:///:memory:')

In [8]:
df=pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [9]:
df

    a   b   c   d
0   5  36  25  50
1  72  54  60  19
2  49  26  27  22
3  20  86  60  22

In [17]:
df.to_sql(name='new_table',con=temp_db)
#df.to_sql(name='new_table',con=temp_db,index=False)

In [11]:
new_df = pd.read_sql(sql='new_table',con=temp_db)

In [12]:
new_df

   index   a   b   c   d
0      0   5  36  25  50
1      1  72  54  60  19
2      2  49  26  27  22
3      3  20  86  60  22

In [18]:
result = pd.read_sql_query(sql="SELECT a,c FROM new_table",con=temp_db)

In [19]:
result

    a   c
0   5  25
1  72  60
2  49  27
3  20  60